# 샘플데이터
import pandas as pd
raw_data = [
    {'사번': 25001, '이름': ' 김철수 ', '나이': 20.0, '부서': '정보보호부', '입사일': '2022-03-02'},
    {'사번': 25001, '이름': ' 김철수 ', '나이': 20.0, '부서': '정보보호부', '입사일': '2022-03-02'},  # 완전 중복 행
    {'사번': 25002, '이름': '이영희', '부서': '기술부', '입사일': '2021-03-02'},               # 나이 키 누락 (NaN 결측)
    {'사번': 25003, '이름': '박민수', '나이': 22.0, '부서': '', '입사일': '2020-03-02'},      # 부서 빈 문자열 ('')
    {'사번': 25004, '이름': '정수진', '나이': 20.0, '부서': '전략본부', '입사일': '2022-03-02'},
    {'사번': 25005, '이름': '한미래', '나이': 23.0, '부서': '개발부', '입사일': '2019-03-02'},
    {'사번': 25005, '이름': '한미래', '나이': 23.0, '부서': '개발부', '입사일': '2019-03-02'},  # 완전 중복 행
    {'사번': 25006, '이름': ' 강동원 ', '나이': 25.0, '부서': '개발부', '입사일': '2018-07-15'},  # 이름 앞뒤 공백
    {'사번': 25007, '이름': '최유리', '부서': '기획부', '입사일': '2023-01-10'},               # 나이 키 누락
    {'사번': 25008, '이름': '조현우', '나이': 21.0, '부서': '   ', '입사일': '2021-08-20'},    # 부서 스페이스 공백 ('   ')
    {'사번': 25009, '이름': '윤서연', '나이': 24.0, '부서': '인사부', '입사일': '2020-11-05'},
    {'사번': 25010, '이름': ' 송민호 ', '나이': 22.0, '부서': '기술부', '입사일': '2022-05-12'},  # 이름 앞뒤 공백
    {'사번': 25011, '이름': '백지은', '부서': '전략본부', '입사일': '2023-04-03'},             # 나이 키 누락
    {'사번': 25012, '이름': '서동현', '나이': 26.0, '부서': '개발부', '입사일': '2017-09-01'},
    {'사번': 25013, '이름': '신아름', '나이': 21.0, '부서': '', '입사일': '2022-10-18'},      # 부서 빈 문자열
    {'사번': 25013, '이름': '신아름', '나이': 21.0, '부서': '', '입사일': '2022-10-18'},      # 중복 행
    {'사번': 25014, '이름': '오상우', '나이': 23.0, '부서': '정보보호부', '입사일': '2021-02-15'},
    {'사번': 25015, '이름': ' 임지선 ', '나이': 20.0, '부서': '기획부', '입사일': '2023-06-01'},  # 이름 앞뒤 공백
    {'사번': 25016, '이름': '하태웅', '나이': 24.0, '부서': '기술부', '입사일': '2019-12-20'},
    {'사번': 25017, '이름': '문채원', '부서': '개발부', '입사일': '2022-08-01'},               # 나이 키 누락
]

df = pd.DataFrame(raw_data)
df.info()
# <class 'pandas.DataFrame'>
# RangeIndex: 20 entries, 0 to 19
# Data columns (total 5 columns):
#  #   Column  Non-Null Count  Dtype
# ---  ------  --------------  -----
#  0   사번      20 non-null     int64
#  1   이름      20 non-null     str
#  2   나이      16 non-null     float64
#  3   부서      20 non-null     str
#  4   입사일     20 non-null     str
# dtypes: float64(1), int64(1), str(3)
# memory usage: 932.0 bytes


# 1. 중복 행 제거 , df.drop_duplicates().reset_index(drop=True)
# df = df.drop_duplicates()  인덱스 유지
df = df.drop_duplicates().reset_index(drop=True)    # 인덱스 초기화/재정렬
print(df.shape)
# (17, 5)

# 2. 타입변환 , df['컬럼명'].astype(변환할타입)
df['사번'] = df['사번'].astype(str)
print(df['사번'].dtype)
# str

# 3. 공백 문자는 결측(NaN) 만들기
# 문자열.strip() 앞뒤 여백/공백 제거 함수
# 문자열.replace('기존문자', '새로운문자') 문자열내 기본문자가 존재하면 새로운문자로 치환
df['이름'] = df['이름'].str.strip()
df['부서'] = df['부서'].str.strip().replace('', None)
print(df[['이름', '부서']])
#      이름     부서
# 0   김철수  정보보호부
# 1   이영희    기술부
# 2   박민수    NaN
# 3   정수진   전략본부
# 4   한미래    개발부
# 5   강동원    개발부
# 6   최유리    기획부
# 7   조현우    NaN
# 8   윤서연    인사부
# 9   송민호    기술부
# 10  백지은   전략본부
# 11  서동현    개발부
# 12  신아름    NaN
# 13  오상우  정보보호부
# 14  임지선    기획부
# 15  하태웅    기술부
# 16  문채원    개발부

# 4. 결측차 확인
print(df.isnull().sum())
# 사번     0
# 이름     0
# 나이     4
# 부서     3
# 입사일    0
# dtype: int64

# 5. 결측치 포함된 행/열 자체 제거 , df.dropna()
new_df = df.dropna(axis=0)
new_df.info()
# <class 'pandas.DataFrame'>
# Index: 10 entries, 0 to 15
# Data columns (total 5 columns):
#  #   Column  Non-Null Count  Dtype
# ---  ------  --------------  -----
#  0   사번      10 non-null     str
#  1   이름      10 non-null     str
#  2   나이      10 non-null     float64
#  3   부서      10 non-null     str
#  4   입사일     10 non-null     str
# dtypes: float64(1), str(4)
# memory usage: 480.0 bytes

# 6. 결측값 채우기, df['컬럼명'].fillna 표본이 부족하거나 손실 막기 위해 대표값 채우기(중앙값(수치), 최빈값(범주))
# 나이 = 수치, 부서 = 범주
df['나이'] = df['나이'].fillna(df['나이'].median()) # 이상치 최소화
df['부서'] = df['부서'].fillna(df['부서'].mode()[0]) # 첫번째 최빈값
print(df)
#        사번   이름    나이     부서         입사일
# 0   25001  김철수  20.0  정보보호부  2022-03-02
# 1   25002  이영희  22.0    기술부  2021-03-02
# 2   25003  박민수  22.0    개발부  2020-03-02
# 3   25004  정수진  20.0   전략본부  2022-03-02
# 4   25005  한미래  23.0    개발부  2019-03-02
# 5   25006  강동원  25.0    개발부  2018-07-15
# 6   25007  최유리  22.0    기획부  2023-01-10
# 7   25008  조현우  21.0    개발부  2021-08-20
# 8   25009  윤서연  24.0    인사부  2020-11-05
# 9   25010  송민호  22.0    기술부  2022-05-12
# 10  25011  백지은  22.0   전략본부  2023-04-03
# 11  25012  서동현  26.0    개발부  2017-09-01
# 12  25013  신아름  21.0    개발부  2022-10-18
# 13  25014  오상우  23.0  정보보호부  2021-02-15
# 14  25015  임지선  20.0    기획부  2023-06-01
# 15  25016  하태웅  24.0    기술부  2019-12-20
# 16  25017  문채원  22.0    개발부  2022-08-01

# 7. 지정된 임계 범위 기준으로 강제 조정, 임계범위 벗어나면 최솟값/최댓값으로 조정
df['나이'] = df['나이'].clip(lower=18, upper=60)

# 8. 연속형 구간 기준으로 범주로 변환
bins = [0,20,25,40] # 구간
labels = ['청년기' , '도약기' , '성숙기' ] # 구간에 따른 범주 정의
# 0 ~ 20 청년기 / 21 ~ 30 도약기 / 31 ~ 40 성숙기
df['연령그룹'] = pd.cut( df['나이'] , bins= bins , labels=labels)
print(df)
#        사번   이름    나이     부서         입사일 연령그룹
# 0   25001  김철수  20.0  정보보호부  2022-03-02  청년기
# 1   25002  이영희  22.0    기술부  2021-03-02  도약기
# 2   25003  박민수  22.0    개발부  2020-03-02  도약기
# 3   25004  정수진  20.0   전략본부  2022-03-02  청년기
# 4   25005  한미래  23.0    개발부  2019-03-02  도약기
# 5   25006  강동원  25.0    개발부  2018-07-15  도약기
# 6   25007  최유리  22.0    기획부  2023-01-10  도약기
# 7   25008  조현우  21.0    개발부  2021-08-20  도약기
# 8   25009  윤서연  24.0    인사부  2020-11-05  도약기
# 9   25010  송민호  22.0    기술부  2022-05-12  도약기
# 10  25011  백지은  22.0   전략본부  2023-04-03  도약기
# 11  25012  서동현  26.0    개발부  2017-09-01  성숙기
# 12  25013  신아름  21.0    개발부  2022-10-18  도약기
# 13  25014  오상우  23.0  정보보호부  2021-02-15  도약기
# 14  25015  임지선  20.0    기획부  2023-06-01  청년기
# 15  25016  하태웅  24.0    기술부  2019-12-20  도약기
# 16  25017  문채원  22.0    개발부  2022-08-01  도약기

# 9. 다양한 날짜형식 ( yyyy-mm , yyyy/mm , yyyy.mm 등) 표준 날짜 변환 함수 , pd.to_datetime()
df['입사일'] = pd.to_datetime( df['입사일'])
print( df['입사일'].dt.year) 
# 1     2021
# 2     2020
# 3     2022
# 4     2019
# 5     2018
# 6     2023
# 7     2021
# 8     2020
# 9     2022
# 10    2023
# 11    2017
# 12    2022
# 13    2021
# 14    2023
# 15    2019
# 16    2022
# Name: 입사일, dtype: int32
# .dt.year 연도추출 , dt.month 월추출 , day_weekday 요일 (0~6)
# .dt.hour 시 , dt.minute 분 , dt.second 초


# 10. 그룹화 집계
new_df = df.groupby( '부서' )['나이'].mean() # 부서별 나이 평균
print( new_df )
# 부서
# 개발부      22.857143
# 기술부      22.666667
# 기획부      21.000000
# 인사부      24.000000
# 전략본부     21.000000
# 정보보호부    21.500000
new_df = df.groupby( ['부서','연령그룹'])['나이'].mean() # 다중 그룹
print( new_df ) 
# 부서     연령그룹
# 개발부    도약기     22.333333
#      성숙기     26.000000
# 기술부    도약기     22.666667
# 기획부    청년기     20.000000
#      도약기     22.000000
# 인사부    도약기     24.000000
# 전략본부   청년기     20.000000
#       도약기     22.000000
# 정보보호부  청년기     20.000000
#       도약기     23.000000

# 다중집계 , -agg( 집계컬럼명 = ('기준컬럼명' , '집계함수명' ) )
new_df = df.groupby( '부서' ).agg(
    인원수 = ('사번' , 'count'),
    평균나이 = ('나이' , 'mean'),
    최고령나이 = ('나이' , 'max' )
)
print(new_df) # 부서별 인원수/평균나이/최고령나이 
#       인원수       평균나이  최고령나이
# 부서                          
# 개발부   7        22.857143   26.0
# 기술부   3        22.666667   24.0
# 기획부   2        21.000000   22.0
# 인사부   1        4.000000    24.0
# 전략본부 2        21.000000   22.0
# 정보보호부  2     21.500000   23.0

# 정규화: (x - 최솟값) .) (최댓값 - 최솟값) 
# 이유 : 0 ~ 1 범위로 만들기 , 서로 다른 속성들 간의 이상치/왜곡방지
# 예] 나이 0 ~ 150 / 연봉 : 0 ~ 300000000000

# 원-핫인코딩 : pd.get_dummies( df , coulumns = [ 컬럼명 ] , dtype=int )
# 이유 : 범주(문자) 이해할 수 있는 이진(0/1) 로 변환 , 0/1
# 예] 개발부=0 , 정보보호부=1 , 기술부 = 0
new_df = pd.get_dummies( df , columns= ['부서'] , dtype=int)
print(new_df)